org/episodes.org
# -*- eval: (load-file "./ubuntu-security-podcast.el") -*-
#+HUGO_SECTION: episode
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
# ensure only a single author is listed, not an array otherwise breaks castinet theme?
# https://github.com/kaushalmodi/ox-hugo/issues/180
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Alex Murray" :explicit no :episode_image img/episode/default.png

* Episode 27
:PROPERTIES:
:EXPORT_FILE_NAME: episode-27
:EXPORT_DATE: 2019-04-08
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :episode_image img/episode/default.png :explicit no :podcast_file USP_E027.mp3 :podcast_duration "29:53" :podcast_bytes "28697625" :permalink "https://ubuntusecuritypodcast.org/episode-27/"
:END:
#+begin_description
Carpe Diem for Apache HTTP Server, plus updates for Dovecot, PolicyKit and the Linux kernel, and we talk to Joe McManus about the recent Asus ShadowHammer supply chain attack and more.
#+end_description
** Overview
Carpe Diem for Apache HTTP Server, plus updates for Dovecot, PolicyKit and the Linux kernel, and we talk to Joe McManus about the recent Asus ShadowHammer supply chain attack and more.
** This week in Ubuntu Security Updates
52 unique CVEs addressed
*** [[[https://usn.ubuntu.com/3928-1/][USN-3928-1]]] Dovecot vulnerability
- 1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7524][CVE-2019-7524]]
- Local user root privilege escalation
  - Stack buffer overflow - indexer-worker processes missing bounds check when copying from the index
  - If local user can modify the dovecot index then could leverage this
    for code-execution in the indexer process context
  - Mitigated by usual hardening techniques (ASLR, stack-protector,
    read-only GOT (via RELRO & BIND_NOW))

*** [[[https://usn.ubuntu.com/3929-1/][USN-3929-1]]] Firebird vulnerabilities
- 2 CVEs addressed in Trusty
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2017-6369][CVE-2017-6369]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2014-9323][CVE-2014-9323]]
- Remote authenticated users execute code
- Remote un-authenticated user DoS via op_response action with a non-empty status

*** [[[https://usn.ubuntu.com/3934-1/][USN-3934-1]]] PolicyKit vulnerability
- 1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6133][CVE-2019-6133]]
- [[https://ubuntusecuritypodcast.org/episode-23/][Episode 23]] - fixed kernel to make process start_time via fork() more atomic
- Updated policykit to also check UIDs match (so now checks start_time,
  PID and UID so can't use another user's authorisations)

*** [[[https://usn.ubuntu.com/3935-1/][USN-3935-1]]] BusyBox vulnerabilities
- 10 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-5747][CVE-2019-5747]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-20679][CVE-2018-20679]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-1000517][CVE-2018-1000517]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2017-16544][CVE-2017-16544]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2017-15873][CVE-2017-15873]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2016-2148][CVE-2016-2148]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2016-2147][CVE-2016-2147]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2015-9261][CVE-2015-9261]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2014-9645][CVE-2014-9645]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2011-5325][CVE-2011-5325]]
- Mix of issues across various components in BusyBox
  - udhcpc:
    - Information disclosure of stack memory in dhcp client / server
      (shared component) due to failure to check DHCP options are correct
      size - original fix was incomplete so this got 2 CVEs
    - Heap buffer overflow via DHCP option parsing of OPTION_6RD (IPv6
      rapid deployment on IPv4 infra)
    - Integer overflow -> heap-based OOB write -> crash -> DoS / code
      execution
  - wget:
    - Heap buffer overflow in wget
  - shell:
    - Failure to sanitize filenames during tab completion - could allow
      code execution etc as user who is running the shell
  - archive handling
    - Integer overflow in bzip2 decompression - OOB write - crash -> DoS
      / code execution?
    - Pointer misuse in zip decompression - OOB read - crash -> DoS
    - directory traversal due to symlinks which point outside the
      current working directory when decompressing tar archives
      (tyhicks)
  - module loading
    - allows users to load modules which are otherwise restricted -
      assumes modules could specify the path so uses basename() on the
      module name - so just need to include a / in the module name to
      circumvent other checks


*** [[[https://usn.ubuntu.com/3937-1/][USN-3937-1]]] Apache HTTP Server vulnerabilities
- 6 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0220][CVE-2019-0220]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0217][CVE-2019-0217]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0196][CVE-2019-0196]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17199][CVE-2018-17199]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17189][CVE-2018-17189]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0211][CVE-2019-0211]]
- "Carpe Diem" and others
  - Local root privilege escalation due to an OOB array access resulting
    in arbitrary function call when apache gracefully restarts - done
    daily via logrotate at 6:25am
    - affects mod_prefork, mod_worker and mod_event
    - main server (running as root) shares a memory segment (the
      scoreboard) with low-privileged worker processes
    - PID, last request handled etc - maintained by the worker
    - worker stores an index into global buckets array in the privileged parent
    - this gets used on restart to restart the worker but no check is done to ensure this is valid
    - so since is in shm child can change this index to ensure it points back into the shm segment where it has write access
    - the bucket contains a function pointer to restart worker - so
      since this is now indexed from the shm segment can make this point
      to any function of choice - AND this gets executed as root by the
      parent
    - Requires some other bug to turn this into a remote exploit since
      need to get R/W access remotely on a worker process
  - Failure to normalize URLs in a consistent manner - LocationMatch and
    RewriteRule might not get applied correctly
  - Race condition in mod_auth_digest could allow user with valid
    credentials to impersonate another and bypass access controls
  - read after free on string comparison in mod_http2 - crash, DoS
  - failure to respect session expiry time in mod_session_cookie
  - DoS via slow-loris type attack to occupy server threads

*** [[[https://usn.ubuntu.com/3936-1/][USN-3936-1]]] AdvanceCOMP vulnerability
- 1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9210][CVE-2019-9210]]
- Integer overflow when decompressing invalid PNG images - OOB write and
  heap OOB read

