content/episode/episode-27.md
+++
title = "Episode 27"
description = "Carpe Diem for Apache HTTP Server, plus updates for Dovecot, PolicyKit and the Linux kernel, and we talk to Joe McManus about the recent Asus ShadowHammer supply chain attack and more."
date = 2019-04-08
lastmod = 2019-08-14T21:21:53+09:30
draft = false
weight = 1016
episode_image = "img/usp_logo_500.png"
explicit = "no"
podcast_file = "USP_E027.mp3"
podcast_duration = "29:53"
podcast_bytes = 28697625
permalink = "https://ubuntusecuritypodcast.org/episode-27/"
+++

## Overview {#overview}

Carpe Diem for Apache HTTP Server, plus updates for Dovecot, PolicyKit and the Linux kernel, and we talk to Joe McManus about the recent Asus ShadowHammer supply chain attack and more.


## This week in Ubuntu Security Updates {#this-week-in-ubuntu-security-updates}

52 unique CVEs addressed


### [[USN-3928-1](https://usn.ubuntu.com/3928-1/)] Dovecot vulnerability {#usn-3928-1-dovecot-vulnerability}

-   1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
    -   [CVE-2019-7524](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7524)
-   Local user root privilege escalation
    -   Stack buffer overflow - indexer-worker processes missing bounds check when copying from the index
    -   If local user can modify the dovecot index then could leverage this
        for code-execution in the indexer process context
    -   Mitigated by usual hardening techniques (ASLR, stack-protector,
        read-only GOT (via RELRO & BIND\_NOW))


### [[USN-3929-1](https://usn.ubuntu.com/3929-1/)] Firebird vulnerabilities {#usn-3929-1-firebird-vulnerabilities}

-   2 CVEs addressed in Trusty
    -   [CVE-2017-6369](https://people.canonical.com/~ubuntu-security/cve/CVE-2017-6369)
    -   [CVE-2014-9323](https://people.canonical.com/~ubuntu-security/cve/CVE-2014-9323)
-   Remote authenticated users execute code
-   Remote un-authenticated user DoS via op\_response action with a non-empty status


### [[USN-3934-1](https://usn.ubuntu.com/3934-1/)] PolicyKit vulnerability {#usn-3934-1-policykit-vulnerability}

-   1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
    -   [CVE-2019-6133](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6133)
-   [Episode 23](https://ubuntusecuritypodcast.org/episode-23/) - fixed kernel to make process start\_time via fork() more atomic
-   Updated policykit to also check UIDs match (so now checks start\_time,
    PID and UID so can't use another user's authorisations)


### [[USN-3935-1](https://usn.ubuntu.com/3935-1/)] BusyBox vulnerabilities {#usn-3935-1-busybox-vulnerabilities}

-   10 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
    -   [CVE-2019-5747](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-5747)
    -   [CVE-2018-20679](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-20679)
    -   [CVE-2018-1000517](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-1000517)
    -   [CVE-2017-16544](https://people.canonical.com/~ubuntu-security/cve/CVE-2017-16544)
    -   [CVE-2017-15873](https://people.canonical.com/~ubuntu-security/cve/CVE-2017-15873)
    -   [CVE-2016-2148](https://people.canonical.com/~ubuntu-security/cve/CVE-2016-2148)
    -   [CVE-2016-2147](https://people.canonical.com/~ubuntu-security/cve/CVE-2016-2147)
    -   [CVE-2015-9261](https://people.canonical.com/~ubuntu-security/cve/CVE-2015-9261)
    -   [CVE-2014-9645](https://people.canonical.com/~ubuntu-security/cve/CVE-2014-9645)
    -   [CVE-2011-5325](https://people.canonical.com/~ubuntu-security/cve/CVE-2011-5325)
-   Mix of issues across various components in BusyBox
    -   udhcpc:
        -   Information disclosure of stack memory in dhcp client / server
            (shared component) due to failure to check DHCP options are correct
            size - original fix was incomplete so this got 2 CVEs
        -   Heap buffer overflow via DHCP option parsing of OPTION\_6RD (IPv6
            rapid deployment on IPv4 infra)
        -   Integer overflow -> heap-based OOB write -> crash -> DoS / code
            execution
    -   wget:
        -   Heap buffer overflow in wget
    -   shell:
        -   Failure to sanitize filenames during tab completion - could allow
            code execution etc as user who is running the shell
    -   archive handling
        -   Integer overflow in bzip2 decompression - OOB write - crash -> DoS
            / code execution?
        -   Pointer misuse in zip decompression - OOB read - crash -> DoS
        -   directory traversal due to symlinks which point outside the
            current working directory when decompressing tar archives
            (tyhicks)
    -   module loading
        -   allows users to load modules which are otherwise restricted -
            assumes modules could specify the path so uses basename() on the
            module name - so just need to include a / in the module name to
            circumvent other checks


### [[USN-3937-1](https://usn.ubuntu.com/3937-1/)] Apache HTTP Server vulnerabilities {#usn-3937-1-apache-http-server-vulnerabilities}

-   6 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
    -   [CVE-2019-0220](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0220)
    -   [CVE-2019-0217](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0217)
    -   [CVE-2019-0196](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0196)
    -   [CVE-2018-17199](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17199)
    -   [CVE-2018-17189](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17189)
    -   [CVE-2019-0211](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-0211)
-   "Carpe Diem" and others
    -   Local root privilege escalation due to an OOB array access resulting
        in arbitrary function call when apache gracefully restarts - done
        daily via logrotate at 6:25am
        -   affects mod\_prefork, mod\_worker and mod\_event
        -   main server (running as root) shares a memory segment (the
            scoreboard) with low-privileged worker processes
        -   PID, last request handled etc - maintained by the worker
        -   worker stores an index into global buckets array in the privileged parent
        -   this gets used on restart to restart the worker but no check is done to ensure this is valid
        -   so since is in shm child can change this index to ensure it points back into the shm segment where it has write access
        -   the bucket contains a function pointer to restart worker - so
            since this is now indexed from the shm segment can make this point
            to any function of choice - AND this gets executed as root by the
            parent
        -   Requires some other bug to turn this into a remote exploit since
            need to get R/W access remotely on a worker process
    -   Failure to normalize URLs in a consistent manner - LocationMatch and
        RewriteRule might not get applied correctly
    -   Race condition in mod\_auth\_digest could allow user with valid
        credentials to impersonate another and bypass access controls
    -   read after free on string comparison in mod\_http2 - crash, DoS
    -   failure to respect session expiry time in mod\_session\_cookie
    -   DoS via slow-loris type attack to occupy server threads


### [[USN-3936-1](https://usn.ubuntu.com/3936-1/)] AdvanceCOMP vulnerability {#usn-3936-1-advancecomp-vulnerability}

-   1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
    -   [CVE-2019-9210](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9210)
-   Integer overflow when decompressing invalid PNG images - OOB write and
    heap OOB read
