content/episode/episode-27.md


### [[USN-3930-1](//usn.ubuntu.com/3930-1/), USN-3930-2] Linux kernel vulnerabilities {#usn-3930-1--usn-dot-ubuntu-dot-com-3930-1--usn-3930-2-linux-kernel-vulnerabilities}

-   13 CVEs addressed in Cosmic and Bionic (HWE)
    -   [CVE-2019-9213](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9213)
    -   [CVE-2019-9162](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9162)
    -   [CVE-2019-9003](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9003)
    -   [CVE-2019-8980](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-8980)
    -   [CVE-2019-8956](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-8956)
    -   [CVE-2019-8912](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-8912)
    -   [CVE-2019-7308](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7308)
    -   [CVE-2019-7222](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7222)
    -   [CVE-2019-7221](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7221)
    -   [CVE-2019-6974](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6974)
    -   [CVE-2019-3460](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3460)
    -   [CVE-2019-3459](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3459)
    -   [CVE-2018-19824](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19824)
-   Jann Horn (GPZ):
    -   mmap minimum address bypass - could allow to turn a kernel NULL
        pointer dereference into code execution
    -   ASN.1 decoding for SNMP NAT missing length checks - OOB R/W possible
    -   side-channel attack due to speculation on pointer arithmetic in eBPF
        programs (Spectre V1)
        -   mitigated when secure boot due to lockdown patches blocking BPF
            program loading
    -   Reference counting race-condition in KVM -> UAF -> guest VM crash
-   UAF + OOPS in IPMI due to race-condition on restart
-   Memory leak on error path of vfs read operations -> DoS
-   UAF in SCTP sendmsg - crash / code execution
-   UAF in AF\_ALG due to failure to NULL structure members
    -   Originally misclassified by NVD as remotely exploitable, confusion
        over socket() use by crypto API?
-   Info leak and a UAF in KVM when using nested virtualisation - not
    enabled by default in Ubuntu kernels unless if install QEMU - this is
    enabled automatically
-   2 different information leak of heap memory in bluetooth subsystem
    triggerable by unauthenticated remote attacker
-   UAF in ALSA USB sound device handling mentioned in [Episode 20](https://ubuntusecuritypodcast.org/episode-20/)


### [[USN-3931-1](https://usn.ubuntu.com/3931-1/), USN-3931-2] Linux kernel vulnerabilities {#usn-3931-1-usn-3931-2-linux-kernel-vulnerabilities}

-   12 CVEs addressed in Bionic, Trusty (HWE) and Xenial (HWE)
    -   [CVE-2019-9213](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9213)
    -   [CVE-2019-8980](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-8980)
    -   [CVE-2019-8912](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-8912)
    -   [CVE-2019-7308](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7308)
    -   [CVE-2019-7222](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7222)
    -   [CVE-2019-7221](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7221)
    -   [CVE-2019-6974](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6974)
    -   [CVE-2019-3460](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3460)
    -   [CVE-2019-3459](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3459)
    -   [CVE-2018-19824](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19824)
    -   [CVE-2018-18021](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-18021)
    -   [CVE-2018-14678](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14678)
-   10 from above, 2 unique:
    -   Potential host system crash / code execution from malicious guest
        for KVM on ARM64 as mentioned previously in [Episode 12](https://ubuntusecuritypodcast.org/episode-12/)
    -   Failure to properly initialise all elements of error handler
        callback in Xen - guest VM crash triggerable by an unprivileged
        attacker in the guest VM


### [[USN-3932-1](https://usn.ubuntu.com/3932-1/), USN-3932-2] Linux kernel vulnerabilities {#usn-3932-1-usn-3932-2-linux-kernel-vulnerabilities}

-   20 CVEs addressed in Xenial and Trusty (HWE)
    -   [CVE-2019-3819](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3819)
    -   [CVE-2019-3701](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3701)
    -   [CVE-2018-9517](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-9517)
    -   [CVE-2018-16884](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16884)
    -   [CVE-2018-14613](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14613)
    -   [CVE-2018-14612](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14612)
    -   [CVE-2018-14611](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14611)
    -   [CVE-2018-14610](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14610)
    -   [CVE-2018-14616](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14616)
    -   [CVE-2018-14614](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14614)
    -   [CVE-2018-13100](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-13100)
    -   [CVE-2018-13099](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-13099)
    -   [CVE-2018-13097](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-13097)
    -   [CVE-2017-18249](https://people.canonical.com/~ubuntu-security/cve/CVE-2017-18249)
    -   [CVE-2019-9213](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9213)
    -   [CVE-2019-7222](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7222)
    -   [CVE-2019-7221](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7221)
    -   [CVE-2019-6974](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6974)
    -   [CVE-2019-3460](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3460)
    -   [CVE-2019-3459](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3459)
-   2 DoS triggerable by root (low priority issue)
-   UAF in PPP over L2TP
-   UAF in NFS41+ when using multiple network namespaces
-   4 different NULL pointer dereferences in btrfs via malicious image
-   Race condition and various reads of invalid memory areas when mounting
    malicious f2fs images
-   mmap min address bypass and others mentioned previously plus
    (bluetooth, kvm etc)


### [[USN-3933-1](https://usn.ubuntu.com/3933-1/), USN-3933-2] Linux kernel vulnerabilities {#usn-3933-1-usn-3933-2-linux-kernel-vulnerabilities}

-   8 CVEs addressed in Trusty and Precise ESM (HWE)
    -   [CVE-2019-9213](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-9213)
    -   [CVE-2019-7222](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7222)
    -   [CVE-2019-6974](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6974)
    -   [CVE-2019-3460](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3460)
    -   [CVE-2019-3459](https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3459)
    -   [CVE-2018-19824](https://people.canonical.com/~ubuntu-security/cve/CVE-2018-19824)
    -   [CVE-2017-18360](https://people.canonical.com/~ubuntu-security/cve/CVE-2017-18360)
    -   [CVE-2017-1000410](https://people.canonical.com/~ubuntu-security/cve/CVE-2017-1000410)


## Goings on in Ubuntu Security Community {#goings-on-in-ubuntu-security-community}


### Supply chain attacks and Ubuntu {#supply-chain-attacks-and-ubuntu}

-   Alex and Joe discuss recent Asus ShadowHammer supply chain attack and how this relates to Ubuntu
    -   <https://securelist.com/operation-shadowhammer/89992/>
    -   <https://www.forbes.com/sites/jasonevangelho/2019/03/29/shadowhammer-asus-1-million-reasons-switch-from-windows-to-linux/>
    -   <https://www.synopsys.com/content/dam/synopsys/sig-assets/reports/2018-ossra.pdf>
    -   <http://go.coverity.com/rs/157-LQW-289/images/2014-Coverity-Scan-Report.pdf>
